// 벌써 끝났어요?
// 네 벌써 끝났어요
// 리액트의 모든 걸 다뤘나요?
// 아니요. 모든 걸 다루진 않았어요
// 심지어 남들 다 하는 투두리스트도 안 만들어봤어요

// (다음)
// 리액트 뿐만 아니라, 리액트 생태계와 밀접하게 연관된
// 다른 기술들은 소개하지도 않았어요
// 리덕스, 아폴로, 리액트 라우터, 브이에스코드, 웹팩
// 이런거 다룬적도 없어요

// (다음)
// 우린 리액트의 핵심만 배웠을 뿐입니다
// 이론만 배웠어요
// 근데 왜 조교행님은 실전개발 안가르쳐줘요?
// 제가 스타일링, 디비 씨알유디까지
// 다 하고나면 프로젝트 강좌 하나 만들거에요
// 강의 한번 다 들었다고 해서
// 리액트 할줄아는거 아니에요. 저도 알아요

// (다음)
// 제가 리액트는 아니었고
// 예전에 뷰제이에스라고
// 책을 한 권 사서 공부한적이 있어요
// 책 다 보고
// 투두리스트 한번 만들어봤는데
// 개발엔 손도 못 댔어요
// 내가 알고있다고 생각했는데
// 사실 하나도 몰랐던거에요
// 그 책만 열번을 다시 봤을거에요
// 제 강의도 마찬가지입니다
// 알아야 할 이론만 재빠르게 먼저 가르칩니다
// 그리고 투두리스트 같은거 집어치우고
// 조잡한 포트폴리오로 실전개발로 바로 뛰어들거에요
// 아마 그때쯤 여러분 머릿속에 제가 이제까지 떠든거
// 십퍼센트 정도 남아있을거에요
// 그땐 모르는부분 계속 뒤져가면서 보는겁니다
// 계속 보는거에요
// 그러면서 만들면서 익숙해지는겁니다

// (다음)
// 이제부터 뭘 배울거냐
// 우리의 못생긴 리액트를
// 좀 볼만하게 바꿔주는 기술을 배울겁니다
// 씨에스에스를 배울겁니다
// 엄마한테 자랑할만한 웹앱 만들어야죠
// 많이 안배울거에요
// 당장 필요한것만 배울겁니다

// (다음)
// 추가적으로 공부를 더 하고싶은사람은
// 리액트에서 제공하는 공식 자습서를 공부해보는것을
// 권장합니다
// 구글에 치면 나옵니다
// 한국어로 번역되어있어요
// 물론 선택사항입니다
// 리액트에 대한 핵심은 다 배웠습니다.
// 이제 스타일링하러 갑시다